content/posts-org/interview-notes-arterm.org
#+hugo_base_dir: ../../
# -*- mode: org; coding: utf-8; -*-
* Header Information                                               :noexport:
#+LaTeX_CLASS_OPTIONS: [11pt]
#+LATEX_HEADER: \usepackage{helvetica}
#+LATEX_HEADER: \setlength{\textwidth}{5.1in} % set width of text portion
#+LATEX_HEADER: \usepackage{geometry}
#+TITLE:     Interview with Arterm
#+AUTHOR:    Fei Ni
#+EMAIL:     fei.ni@helix.com
#+DATE:      2021-01-01
#+HUGO_CATEGORIES: helix
#+HUGO_tags: helix
#+hugo_auto_set_lastmod: t
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   ^:{}
#+INFOJS_OPT: view:nil toc:nil ltoc:nil mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+HTML_HEAD: <link rel="stylesheet" href="org.css" type="text/css"/>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

#+STARTUP: hidestars

#+STARTUP: overview   (or: showall, content, showeverything)
http://orgmode.org/org.html#Visibility-cycling  info:org#Visibility cycling

#+TODO: TODO(t) NEXT(n) STARTED(s) WAITING(w@/!) SOMEDAY(S!) | DONE(d!/!) CANCELLED(c@/!)
http://orgmode.org/org.html#Per_002dfile-keywords  info:org#Per-file keywords

#+TAGS: important(i) private(p)
#+TAGS: @HOME(h) @OFFICE(o)
http://orgmode.org/org.html#Setting-tags  info:org#Setting tags

#+NOstartup: beamer
#+NOLaTeX_CLASS: beamer
#+NOLaTeX_CLASS_OPTIONS: [bigger]
#+NOBEAMER_FRAME_LEVEL: 2


# Start from here

* Basic Info

| Candidate Name | Arterm                |
| Job Level      | SW                    |
| Type           | onsite tech screening |
| Date           | 06/07/2021            |

Coderpad link: https://app.coderpad.io/TX46RZHP


* timeline

|  Time | activity                   |
| 13:30 | Interview started          |
| 13:45 | Switch to coding challenge |
| 13:47 | Start coding               |
| 14:30 | Stop the session           |





* General notes

Notes:
 - He mentioned he is amazed about bio-informatics
 - He also mentioned he is amazed about what helix is doing


Pros: 
  - thinking and coding it loudly
  - he is confidence 
  - fluent about python coding
  - Start coding with testing
Cons:
  - The implementation doesn't work for a sequence with multiple start Codon, such as "AUGAUGUGA"
  - Didn't mention validating the input until we gave the prompt
  - Single function returned Boolean and string on demand, which is not a clear interface design
  - Put major logic into inner function, which may not be good for unit test(maybe this is just my bias)
