content/posts/interview-notes-arterm.md
+++
title = "Interview with Arterm"
author = ["Fei Ni"]
date = 2021-06-07T14:50:33-07:00
lastmod = 2021-06-07T14:50:33-07:00
tags = ["helix"]
categories = ["helix"]
draft = false
+++

## <span class="section-num">1</span> Basic Info {#basic-info}

| Candidate Name | Arterm                |
|----------------|-----------------------|
| Job Level      | SW                    |
| Type           | onsite tech screening |
| Date           | 06/07/2021            |

Coderpad link: <https://app.coderpad.io/TX46RZHP>


## <span class="section-num">2</span> timeline {#timeline}

| Time  | activity                   |
|-------|----------------------------|
| 13:30 | Interview started          |
| 13:45 | Switch to coding challenge |
| 13:47 | Start coding               |
| 14:30 | Stop the session           |


## <span class="section-num">3</span> General notes {#general-notes}

Notes:

-   He mentioned he is amazed about bio-informatics
-   He also mentioned he is amazed about what helix is doing

Pros:

-   thinking and coding it loudly
-   he is confidence
-   fluent about python coding
-   Start coding with testing

Cons:

-   The implementation doesn't work for a sequence with multiple start Codon, such as "AUGAUGUGA"
-   Didn't mention validating the input until we gave the prompt
-   Single function returned Boolean and string on demand, which is not a clear interface design
-   Put major logic into inner function, which may not be good for unit test(maybe this is just my bias)
